/******************************************************************************
 *                  Shanghai ChipON Micro-Electronic Co.,Ltd
 ******************************************************************************
 *  @File Name        : app_task.h
 *  @Author           : ChipON AE/FAE Group
 *  @Data             : 2023-10-16
 *  @HW Version       : KF32A158-MINI-EVB_V1.0
 *  @Version          : V1.0.0.1_alpha
 *  @Description      : This file provides hli for spi
 ******************************************************************************
 *  Copyright (C) by Shanghai ChipON Micro-Electronic Co.,Ltd
 *  All rights reserved.
 *
 *  This software is copyright protected and proprietary to
 *  Shanghai ChipON Micro-Electronic Co.,Ltd.
 *****************************************************************************/

/******************************************************************************
 *                      Include Files
 ******************************************************************************/
#include "string.h"
#include "stdio.h"
#include "app_task.h"
/******************************************************************************
 *                      Macro Definitions
 ******************************************************************************/

/******************************************************************************
 *                      Constants
 ******************************************************************************/

/******************************************************************************
 *                      Type definitions
 ******************************************************************************/

/******************************************************************************
 *                      Variables
 ******************************************************************************/

/******************************************************************************
 *                      Function definitions
 ******************************************************************************/

/**
 * @brief 系统延时
 *
 * @param  msec-延时时间，单位毫秒
 */
void os_sleep(int msec)
{
    TickType_t ticks = msec / portTICK_PERIOD_MS;

    /* Minimum delay = 1 tick */
    vTaskDelay(ticks ? ticks : 1);
}

/**
 * @brief 启动任务
 *
 * @param pvParameters-函数入参
 *
 * @return None
 */
void main_task(void *pvParameters)
{
    uint32_t device_run_num = 0;

    while (1)
    {
        os_sleep(1);
        device_run_num++;
    }
}

/* EOF */
